## Production: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.cache_buster will be created
  + resource "aws_iam_policy" "cache_buster" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "cache_buster"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudfront:ListInvalidations",
                          + "cloudfront:GetInvalidation",
                          + "cloudfront:GetDistributionConfig",
                          + "cloudfront:GetDistribution",
                          + "cloudfront:CreateInvalidation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_user.cache_buster will be created
  + resource "aws_iam_user" "cache_buster" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "cache_buster"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.cache_buster will be created
  + resource "aws_iam_user_policy_attachment" "cache_buster" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "cache_buster"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>